#include <iostream>

using namespace std;
//---------------------Функции и Прототипы---------------------------------------

// Используя оператор цикла do while, составить программу, 
// которая будет требовать ввод цифр с клавиатуры до тех пор, пока не будет введена цифра 1.



//------------------------MAIN----------------------------------------------------
int main() {
	setlocale(LC_ALL, "RU");

	//-------------------------------САМА ПРОГА-------------------------------------

	int x;

	do
	{
		cout << "Введите лбое число: ";
		cin >> x;

	} while (x != 1);



	system("pause");

	return 0;
}
